---
kind: other
id: Properties.T:Autodesk.Revit.DB.GeometryInstance
source: html/4d0ed1ce-f265-c640-c681-f58ba0b4379d.htm
---
# GeometryInstance Properties

The ElementId of the GeometryObject's GraphicsStyle